open-dynamic-robot-initiative/open-motor-driver-initiative/firmware/uomodri_c28/uomodri_rs485_clb.syscfg
clb2.tile                          = TILE2;
TILE2.$name                        = "TILE2";
TILE2.BOUNDARY.$name               = "BOUNDARY2";
TILE2.BOUNDARY.tileSelect0         = "TILE1";
TILE2.BOUNDARY.tileOutputSelect0   = 2;
TILE2.BOUNDARY.boundaryInput1      = "tileOutput";
TILE2.BOUNDARY.input_pipeline1     = true;
TILE2.BOUNDARY.tileSelect1         = "TILE1";
TILE2.BOUNDARY.boundaryInput0      = "customWave";
TILE2.BOUNDARY.tileOutputSelect1   = 4;
TILE2.BOUNDARY.in_sync1            = true;
TILE2.BOUNDARY.in_custom_source0   = "high(200)\n\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nrpt(3)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\nrpt_end\n\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\n\nhigh(200)\n\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nrpt(3)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\nrpt_end\n\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\n\nhigh(200)\n\nlow(8)\nhigh(8)\nhigh(8)\nhigh(8)\nhigh(8)\nhigh(8)\nhigh(8)\nhigh(8)\nhigh(8)\nhigh(8)\n\nrpt(3)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\nrpt_end\n\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nhigh(8)\n\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\n\nlow(8)\nlow(8)\nhigh(8)\nlow(8)\nhigh(8)\nlow(8)\nlow(8)\nlow(8)\nlow(8)\nhigh(8)\n\nhigh(200)\n\nrpt(500)\nlow(8)\nrpt_end\n\nhigh(200)";
TILE2.LUT_0.$name                  = "LUT_6";
TILE2.LUT_0.lutDescription         = "RS485_LUT_CNT0_RESET";
TILE2.LUT_0.i0                     = "BOUNDARY.in1";
TILE2.LUT_0.eqn                    = "i0 | i1";
TILE2.LUT_0.i1                     = "COUNTER_0.count_match1";
TILE2.LUT_1.$name                  = "LUT_7";
TILE2.LUT_2.$name                  = "LUT_8";
TILE2.FSM_0.$name                  = "FSM_6";
TILE2.FSM_1.$name                  = "FSM_7";
TILE2.FSM_2.$name                  = "FSM_8";
TILE2.COUNTER_0.$name              = "COUNTER_6";
TILE2.COUNTER_0.counterDescription = "RS485_CNT0_CLK_DIVIDER";
TILE2.COUNTER_0.mode0              = "1";
TILE2.COUNTER_0.mode1              = "1";
TILE2.COUNTER_0.match1_val         = "7";
TILE2.COUNTER_0.reset              = "LUT_0.OUT";
TILE2.COUNTER_1.$name              = "COUNTER_7";
TILE2.COUNTER_1.counterDescription = "RS485_CNT1_EVT_CNT";
TILE2.COUNTER_1.mode0              = "COUNTER_0.count_match1";
TILE2.COUNTER_1.mode1              = "1";
TILE2.COUNTER_1.match1_val         = "9";
TILE2.COUNTER_1.match2_val         = "10";
TILE2.COUNTER_1.reset              = "BOUNDARY.in1";
TILE2.COUNTER_2.$name              = "COUNTER_8";
TILE2.COUNTER_2.counterDescription = "RS485_CNT2_ADDR_TEST";
TILE2.COUNTER_2.event              = "BOUNDARY.in0";
TILE2.COUNTER_2.mode0              = "COUNTER_0.count_match1";
TILE2.COUNTER_2.serializer_en      = true;
TILE2.COUNTER_2.action             = "Shift Left";
TILE2.COUNTER_2.reset              = "BOUNDARY.in1";
TILE2.OUTLUT_0.$name               = "OUTLUT_16";
TILE2.OUTLUT_1.$name               = "OUTLUT_17";
TILE2.OUTLUT_2.$name               = "OUTLUT_18";
TILE2.OUTLUT_3.$name               = "OUTLUT_19";
TILE2.OUTLUT_4.$name               = "OUTLUT_20";
TILE2.OUTLUT_4.outlutDescription   = "RS485_ADDR1_VALID";
TILE2.OUTLUT_4.i0                  = "COUNTER_2.count_match1";
TILE2.OUTLUT_4.i1                  = "COUNTER_1.count_match1";
TILE2.OUTLUT_4.i2                  = "1";
TILE2.OUTLUT_4.eqn                 = "i0 & i1";
TILE2.OUTLUT_5.$name               = "OUTLUT_21";
TILE2.OUTLUT_5.outlutDescription   = "RS485_ADDR2_VALID";
TILE2.OUTLUT_5.i0                  = "COUNTER_2.count_match2";
TILE2.OUTLUT_5.i1                  = "COUNTER_1.count_match1";
TILE2.OUTLUT_5.i2                  = "1";
TILE2.OUTLUT_5.eqn                 = "i0 & i1";
TILE2.OUTLUT_6.$name               = "OUTLUT_22";
TILE2.OUTLUT_7.$name               = "OUTLUT_23";
TILE2.HLC.$name                    = "HLC_2";
TILE2.HLC.program0.$name           = "HLCP_8";
TILE2.HLC.program1.$name           = "HLCP_9";
TILE2.HLC.program2.$name           = "HLCP_10";
TILE2.HLC.program3.$name           = "HLCP_11";
TILE2.AOC_0.$name                  = "AOC_16";
TILE2.AOC_1.$name                  = "AOC_17";
TILE2.AOC_2.$name                  = "AOC_18";
TILE2.AOC_3.$name                  = "AOC_19";
TILE2.AOC_4.$name                  = "AOC_20";
TILE2.AOC_5.$name                  = "AOC_21";
TILE2.AOC_6.$name                  = "AOC_22";
TILE2.AOC_7.$name                  = "AOC_23";

clb3.tile                  = TILE3;
TILE3.$name                = "TILE7";
TILE3.BOUNDARY.$name       = "BOUNDARY1";
TILE3.LUT_0.$name          = "LUT_3";
TILE3.LUT_1.$name          = "LUT_4";
TILE3.LUT_2.$name          = "LUT_5";
TILE3.FSM_0.$name          = "FSM_3";
TILE3.FSM_1.$name          = "FSM_4";
TILE3.FSM_2.$name          = "FSM_5";
TILE3.COUNTER_0.$name      = "COUNTER_3";
TILE3.COUNTER_1.$name      = "COUNTER_4";
TILE3.COUNTER_2.$name      = "COUNTER_5";
TILE3.OUTLUT_0.$name       = "OUTLUT_8";
TILE3.OUTLUT_1.$name       = "OUTLUT_9";
TILE3.OUTLUT_2.$name       = "OUTLUT_10";
TILE3.OUTLUT_3.$name       = "OUTLUT_11";
TILE3.OUTLUT_4.$name       = "OUTLUT_12";
TILE3.OUTLUT_5.$name       = "OUTLUT_13";
TILE3.OUTLUT_6.$name       = "OUTLUT_14";
TILE3.OUTLUT_7.$name       = "OUTLUT_15";
TILE3.HLC.$name            = "HLC_1";
TILE3.HLC.program0.$name   = "HLCP_4";
TILE3.HLC.program1.$name   = "HLCP_5";
TILE3.HLC.program2.$name   = "HLCP_6";
TILE3.HLC.program3.$name   = "HLCP_7";
TILE3.AOC_0.$name          = "AOC_8";
TILE3.AOC_0.stage1_mux     = true;
TILE3.AOC_0.aocDescription = "SCI_TX inverter";
TILE3.AOC_0.bypass_mux     = false;
TILE3.AOC_0.input_mode     = "INPUT";
TILE3.AOC_1.$name          = "AOC_9";
TILE3.AOC_2.$name          = "AOC_10";
TILE3.AOC_3.$name          = "AOC_11";
TILE3.AOC_4.$name          = "AOC_12";
TILE3.AOC_5.$name          = "AOC_13";
TILE3.AOC_6.$name          = "AOC_14";
TILE3.AOC_7.$name          = "AOC_15";
